billing_cf/InformationRegisters/энргНастройкиЮрОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиЮрОтдела</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начальник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргНастройкиЮрОтдела/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получить начальника
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация.  
//  Район		 - СправочникСсылка.энргЗоныОтвественности - Район.
//  Пользователь - СправочникСсылка.Пользователи - Пользователь. 
// 
// Возвращаемое значение:
//  РезультатЗапроса - Результат запроса.
//
Функция ПолучитьНачальника(Организация = Неопределено,Район = Неопределено, Пользователь = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргНастройкиЮрОтдела.Организация КАК Организация,
		|	энргНастройкиЮрОтдела.Район КАК Район,
		|	энргНастройкиЮрОтдела.Начальник КАК Начальник
		|ПОМЕСТИТЬ ВТ_Начальники
		|ИЗ
		|	РегистрСведений.энргНастройкиЮрОтдела КАК энргНастройкиЮрОтдела
		|ГДЕ
		|	1 = 1
		|	И энргНастройкиЮрОтдела.Организация = &Организация
		|	И энргНастройкиЮрОтдела.Район = &Район
		|	И энргНастройкиЮрОтдела.Начальник = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.Представление КАК Почта,
		|	ВТ_Начальники.Начальник КАК Начальник,
		|	ВТ_Начальники.Организация КАК Организация,
		|	ВТ_Начальники.Район КАК Район
		|ИЗ
		|	ВТ_Начальники КАК ВТ_Начальники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ВТ_Начальники.Начальник = ПользователиКонтактнаяИнформация.Ссылка
		|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMAILПользователя))
		|			И (ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))";
	
	
	
	Если Организация = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Организация = &Организация","");		
	Иначе 
		Запрос.УстановитьПараметр("Организация"	,Организация);
	КонецЕсли;
	Если Район = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Район = &Район","");		
	Иначе 
		Запрос.УстановитьПараметр("Район"	,Район);
	КонецЕсли;
	Если Пользователь = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргНастройкиЮрОтдела.Начальник = &Пользователь","");		
	Иначе 
		Запрос.УстановитьПараметр("Пользователь"	,Пользователь);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
